R3b3lAllianc3/nRF52-ble-lr-demo/peripheral_lr_demo_kit/main.c
}

#define NRF_LOG_FLOAT_MARKER8 "%10d.%08d"

#define NRF_LOG_FLOAT8(val) (int32_t)(val),                                      \
                       (int32_t)(((val > 0) ? (val) - (int32_t)(val)            \
                                            : (int32_t)(val) - (val))*100000000)


/**@brief Function for handling scan request report.
 * Print the RSSI and address of the initiator if the RSSI has changed.
 */
static void on_scan_req_report(ble_gap_evt_scan_req_report_t const * p_scan_req_report)
{
    static int8_t         rssi_value = 0;
    float per_value;

   
     if(rssi_value != p_scan_req_report->rssi)
     {
       rssi_value = p_scan_req_report->rssi;
       per_value = calculate_per();
       NRF_LOG_INFO("Received scan request with RSSI %d", rssi_value);
       NRF_LOG_INFO("addr %02x:%02x:%02x:%02x:%02x:%02x",
               p_scan_req_report->peer_addr.addr[0],
               p_scan_req_report->peer_addr.addr[1],
               p_scan_req_report->peer_addr.addr[2],
               p_scan_req_report->peer_addr.addr[3],
               p_scan_req_report->peer_addr.addr[4],
               p_scan_req_report->peer_addr.addr[5]);
       //NRF_LOG_INFO("PER: " NRF_LOG_FLOAT_MARKER8 "\r\n", NRF_LOG_FLOAT8(calculate_per()));
       NRF_LOG_INFO("PER: " NRF_LOG_FLOAT_MARKER8 "\r\n", NRF_LOG_FLOAT8(per_value));
    }
    sprintf(&m_summary_string1[0], "%d", rssi_value);
    sprintf(&m_summary_string2[0], "%0.8f", per_value);
    UG_TextboxSetText(&window_1 , TXB_ID_5 , m_summary_string1);
    UG_TextboxSetText(&window_1 , TXB_ID_6 , m_summary_string2);
}


/**@brief Function for handling BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    
    uint32_t              err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
       
        case BLE_GAP_EVT_CONNECTED:
            on_ble_gap_evt_connected(p_gap_evt);
            break;
        
        case BLE_GAP_EVT_DISCONNECTED:
            on_ble_gap_evt_disconnected(p_gap_evt);
            break;
        
        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        {
            NRF_LOG_INFO("Connection interval updated: 0x%x, 0x%x.",
                p_gap_evt->params.conn_param_update.conn_params.min_conn_interval,
                p_gap_evt->params.conn_param_update.conn_params.max_conn_interval);
        } break;
        
       case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
       {
           // Accept parameters requested by the peer.
           ble_gap_conn_params_t params;
           params = p_gap_evt->params.conn_param_update_request.conn_params;
           err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle, &params);
           APP_ERROR_CHECK(err_code);
       
           NRF_LOG_INFO("Connection interval updated (upon request): 0x%x, 0x%x.",
               p_gap_evt->params.conn_param_update_request.conn_params.min_conn_interval,
               p_gap_evt->params.conn_param_update_request.conn_params.max_conn_interval);
       } break;
       
       case BLE_GATTS_EVT_SYS_ATTR_MISSING:
       {
           NRF_LOG_DEBUG("BLE_GATTS_EVT_SYS_ATTR_MISSING");
           err_code = sd_ble_gatts_sys_attr_set(p_gap_evt->conn_handle, NULL, 0, 0);
           APP_ERROR_CHECK(err_code);
       } break;
       
       case BLE_GATTC_EVT_TIMEOUT: // Fallthrough.
       case BLE_GATTS_EVT_TIMEOUT:
       {
           NRF_LOG_DEBUG("GATT timeout, disconnecting.");
           err_code = sd_ble_gap_disconnect(m_conn_handle,
                                            BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
           APP_ERROR_CHECK(err_code);
       } break;
       
       case BLE_GAP_EVT_PHY_UPDATE:
       {
            NRF_LOG_DEBUG("BLE_GAP_EVT_PHY_UPDATE: not implemented.");
           
       } break;
       
       case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
       { 
           NRF_LOG_DEBUG("BLE_GAP_EVT_PHY_UPDATE_REQUEST: not implemented.");
       } break;

       case BLE_GAP_EVT_SCAN_REQ_REPORT:
       {
          on_scan_req_report(&p_gap_evt->params.scan_req_report);
       } break;


        //MQ
        case BLE_GAP_EVT_RSSI_CHANGED:
        {
            int8_t rssi_value;  
            uint8_t rssi_channel_index;
            float per_value;
            static float per_value_prev = 0.0;
            static int8_t rssi_value_prev = 0;

            err_code = sd_ble_gap_rssi_get(p_gap_evt->conn_handle, &rssi_value, &rssi_channel_index);
            APP_ERROR_CHECK(err_code);
            per_value = calculate_per();
            //NRF_LOG_INFO("RSSI in connected mode %d", rssi_value);
            //NRF_LOG_INFO("PER: " NRF_LOG_FLOAT_MARKER8 "\r\n", NRF_LOG_FLOAT8(per_value));
            if (rssi_value_prev != rssi_value) {
              sprintf(&m_summary_string1[0], "%d", rssi_value);
              UG_TextboxSetText(&window_1 , TXB_ID_5 , m_summary_string1);
              rssi_value_prev = rssi_value;
            }
            if (per_value_prev != per_value) {
              sprintf(&m_summary_string2[0], "%0.8f", per_value);
              UG_TextboxSetText(&window_1 , TXB_ID_6 , m_summary_string2);
              per_value_prev = per_value;
            }                                                
        } break;

        default:
        {
          NRF_LOG_DEBUG("Received an unimplemented BLE event.");
            // No implementation needed.
        } break;
    }
}

/**@brief This function will disconnect if connected, and stop advertising if advertising. */
static void disconnect_stop_adv(void)
{
    ret_code_t err_code;
    // If advertising, stop advertising.
    (void) sd_ble_gap_adv_stop(m_adv_handle);
    
    // If connected, disconnect.
    if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
      NRF_LOG_INFO("Disconnecting...");
      
      m_app_initiated_disconnect = true;
      m_waiting_for_disconnect_evt    = true;
      err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
      
      if (err_code != NRF_SUCCESS)
      {
               NRF_LOG_ERROR("disconnect_stop_adv, sd_ble_gap_disconnect() failed: 0x%0x.", err_code);
               m_app_initiated_disconnect = false;
               m_waiting_for_disconnect_evt    = false;
      }
      while (m_waiting_for_disconnect_evt == true)
      {
       // Wait until BLE_GAP_EVT_DISCONNECT has occured.
      }
     
