R3b3lAllianc3/nRF52-ble-lr-demo/peripheral_lr_demo_kit/main.c
    } break;
    
    case SELECTION_NON_CONNECTABLE:
    {
      // Current state is connectable advertising. Start blinking associated LED.
      new_adv_selection = SELECTION_CONNECTABLE;

    } break;
  }
  on_non_conn_or_conn_adv_selection_state_set(new_adv_selection);

}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
void bsp_evt_handler(bsp_event_t event)
{
  ret_code_t err_code;	
   
    if(event != BUTTON_NOT_IN_USE_EVENT)
    {
        
    
	 // Set the correct parameters, depending on the button pushed.		
        switch (event)
        {
          case PHY_SELECTION_BUTTON_EVENT:
          {
            on_phy_selection_button();
          } break;
						
	  case OUTPUT_POWER_SELECTION_BUTTON_EVENT:
	  {
	  	on_output_power_selection_button();
	  } break;

          case NON_CONN_OR_CONN_ADV_BUTTON_EVENT:
          {
            on_non_conn_or_conn_adv_selection();
          } break;
                        
          default:
            break;
        }
        
        disconnect_stop_adv();
	advertising_data_set(); 
	advertising_start();
    }
   
}


/**@brief Function for initializing buttons and leds.
 */
static void buttons_leds_init(void)
{
    ret_code_t err_code;
   
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_evt_handler);
    APP_ERROR_CHECK(err_code);

}

/**@brief Function for starting advertising with the current selections of output power, phy, and connectable or non-connectable advertising.
 */
static void set_current_adv_params_and_start_advertising(void)
{
  
  phy_selection_set_state(m_adv_scan_phy_selected);
  on_non_conn_or_conn_adv_selection_state_set(m_adv_scan_type_selected);
  output_power_selection_set(m_output_power_selected);
  
  advertising_data_set();
  advertising_start();

}

static void gpiote_out_init(uint32_t index, uint32_t pin, uint32_t polarity, uint32_t init_val) 
{
    NRF_GPIOTE->CONFIG[index] |= ((GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos) & GPIOTE_CONFIG_MODE_Msk) |
                            ((pin << GPIOTE_CONFIG_PSEL_Pos) & GPIOTE_CONFIG_PSEL_Msk) |
                            ((polarity << GPIOTE_CONFIG_POLARITY_Pos) & GPIOTE_CONFIG_POLARITY_Msk) |
                            ((init_val << GPIOTE_CONFIG_OUTINIT_Pos) & GPIOTE_CONFIG_OUTINIT_Msk);
}

static void init_ppi(void) 
{
    const uint32_t GPIO_CH0 = 0;
    const uint32_t GPIO_CH1 = 1;
    const uint32_t GPIO_CH2 = 2;
    const uint32_t GPIO_CH3 = 3;
    const uint32_t PPI_CH0 = 10;
    const uint32_t PPI_CH1 = 11;
    const uint32_t PPI_CH2 = 12;
    const uint32_t PPI_CH3 = 13;    
        
    nrf_gpio_cfg_output(PIN_EVENTS_END);
    nrf_gpio_cfg_output(PIN_EVENTS_CRC_OK);
    nrf_gpio_cfg_output(PIN_EVENTS_CRC_ERROR);
    nrf_gpio_cfg_output(PIN_EVENTS_RXREADY);
        
    gpiote_out_init(GPIO_CH0, PIN_EVENTS_END, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // end
    gpiote_out_init(GPIO_CH1, PIN_EVENTS_CRC_OK, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // crc ok
    gpiote_out_init(GPIO_CH2, PIN_EVENTS_CRC_ERROR, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // crc error
    gpiote_out_init(GPIO_CH3, PIN_EVENTS_RXREADY, GPIOTE_CONFIG_POLARITY_Toggle, GPIOTE_CONFIG_OUTINIT_Low); // events ready
        
    NRF_PPI->CH[PPI_CH0].EEP = (uint32_t) &(NRF_RADIO->EVENTS_END);
    NRF_PPI->CH[PPI_CH0].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH0]);

    NRF_PPI->CH[PPI_CH1].EEP = (uint32_t) &(NRF_RADIO->EVENTS_CRCOK);
    NRF_PPI->CH[PPI_CH1].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH1]);

    NRF_PPI->CH[PPI_CH2].EEP = (uint32_t) &(NRF_RADIO->EVENTS_CRCERROR);
    NRF_PPI->CH[PPI_CH2].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH2]);
               
    NRF_PPI->CH[PPI_CH3].EEP = (uint32_t) &(NRF_RADIO->EVENTS_RXREADY);
    NRF_PPI->CH[PPI_CH3].TEP = (uint32_t) &(NRF_GPIOTE->TASKS_OUT[GPIO_CH3]);

    //MQ  Fork tasks to activate EGU.        
    NRF_PPI->FORK[PPI_CH0].TEP = (uint32_t) &(NRF_EGU3->TASKS_TRIGGER[EGU_CH0]);
    NRF_PPI->FORK[PPI_CH1].TEP = (uint32_t) &(NRF_EGU3->TASKS_TRIGGER[EGU_CH1]);
    NRF_PPI->FORK[PPI_CH2].TEP = (uint32_t) &(NRF_EGU3->TASKS_TRIGGER[EGU_CH2]);
    NRF_PPI->FORK[PPI_CH3].TEP = (uint32_t) &(NRF_EGU3->TASKS_TRIGGER[EGU_CH3]);  
       
    NRF_EGU3->INTENSET = EGU_INTENSET_TRIGGERED0_Msk | EGU_INTENSET_TRIGGERED1_Msk | EGU_INTENSET_TRIGGERED2_Msk | EGU_INTENSET_TRIGGERED3_Msk;
    NVIC_ClearPendingIRQ(SWI3_EGU3_IRQn);
    NVIC_SetPriority(SWI3_EGU3_IRQn, APP_IRQ_PRIORITY_LOW);
    NVIC_EnableIRQ(SWI3_EGU3_IRQn);

    NRF_PPI->CHENSET = (1 << PPI_CH0) | (1 << PPI_CH1) | (1 << PPI_CH2) | (1 << PPI_CH3);
}

void SWI3_EGU3_IRQHandler(void)
{
    if (NRF_EGU3->EVENTS_TRIGGERED[EGU_CH0]) {     
        NRF_EGU3->EVENTS_TRIGGERED[EGU_CH0] = 0;
        ++end_event;
       
    }
    if (NRF_EGU3->EVENTS_TRIGGERED[EGU_CH1]) {        
        NRF_EGU3->EVENTS_TRIGGERED[EGU_CH1] = 0;
        ++crc_ok_event;
    }
    if (NRF_EGU3->EVENTS_TRIGGERED[EGU_CH2]) {        
        NRF_EGU3->EVENTS_TRIGGERED[EGU_CH2] = 0;
        ++crc_error_event;
    }
    if (NRF_EGU3->EVENTS_TRIGGERED[EGU_CH3]) {        
        NRF_EGU3->EVENTS_TRIGGERED[EGU_CH3] = 0;
        ++ready_rxevent;
    }
}

void window_1_callback ( UG_MESSAGE* msg )
{

    return;
}

UG_GUI gui;
UG_TEXTBOX textbox_toggle_phy;
UG_TEXTBOX textbox_toggle_power;
UG_TEXTBOX textbox_toggle_adv_type; //advertising type (non-connectable / connectable)
UG_TEXTBOX textbox_rssi_label;
UG_TEXTBOX textbox_per_label;
UG_TEXTBOX textbox_rssi_number;
UG_TEXTBOX textbox_per_number;
UG_BUTTON phy_button;
UG_BUTTON power_button;
UG_BUTTON adv_button;
#define MAX_OBJECTS 10
UG_OBJECT obj_buff_wnd_1[MAX_OBJECTS];

int main(void)
{
    // Initialize.
    log_init();
   
    timer_init();
    buttons_leds_init();
    init_ppi();

    power_management_init();
    ble_stack_init();
    
    gap_params_init();

    UG_Init(&gui, 240, 320, p_lcd);


    /* Create the window */
    UG_WindowCreate ( &window_1 , obj_buff_wnd_1 , MAX_OBJECTS, window_1_callback ) ;
    /* Modify the window t i t l e */
    UG_WindowSetTitleText (&window_1 , "Nordic Range Demo") ;
    UG_WindowSetTitleTextFont (&window_1 , &FONT_10X16) ;
    UG_WindowSetTitleTextAlignment(&window_1, ALIGN_CENTER);

