R3b3lAllianc3/nRF52-ble-lr-demo/peripheral_lr_demo_kit/main.c
#define TXT_ID_0_X_LOCATION 15
#define TXT_ID_0_Y_LOCATION 10
#define TXT_ID_0_WIDTH 200
#define TXT_ID_0_HEIGHT 25

#define INTERWIDGET_SPACE 10

#define BTN_ID_0_X_LOCATION TXT_ID_0_X_LOCATION
#define BTN_ID_0_Y_LOCATION TXT_ID_0_Y_LOCATION+TXT_ID_0_HEIGHT+INTERWIDGET_SPACE
#define BTN_ID_0_WIDTH TXT_ID_0_WIDTH
#define BTN_ID_0_HEIGHT 30

#define TXT_ID_1_X_LOCATION TXT_ID_0_X_LOCATION
#define TXT_ID_1_Y_LOCATION BTN_ID_0_Y_LOCATION+BTN_ID_0_HEIGHT+INTERWIDGET_SPACE
#define TXT_ID_1_WIDTH TXT_ID_0_WIDTH
#define TXT_ID_1_HEIGHT TXT_ID_0_HEIGHT

#define BTN_ID_1_X_LOCATION TXT_ID_0_X_LOCATION
#define BTN_ID_1_Y_LOCATION TXT_ID_1_Y_LOCATION+TXT_ID_1_HEIGHT+INTERWIDGET_SPACE
#define BTN_ID_1_WIDTH TXT_ID_0_WIDTH
#define BTN_ID_1_HEIGHT BTN_ID_0_HEIGHT

#define TXT_ID_2_X_LOCATION TXT_ID_0_X_LOCATION
#define TXT_ID_2_Y_LOCATION BTN_ID_1_Y_LOCATION+BTN_ID_1_HEIGHT+INTERWIDGET_SPACE
#define TXT_ID_2_WIDTH TXT_ID_0_WIDTH
#define TXT_ID_2_HEIGHT TXT_ID_0_HEIGHT

#define BTN_ID_2_X_LOCATION TXT_ID_0_X_LOCATION
#define BTN_ID_2_Y_LOCATION TXT_ID_2_Y_LOCATION+TXT_ID_2_HEIGHT+INTERWIDGET_SPACE
#define BTN_ID_2_WIDTH TXT_ID_0_WIDTH
#define BTN_ID_2_HEIGHT BTN_ID_0_HEIGHT

#define TXT_ID_3_X_LOCATION TXT_ID_0_X_LOCATION + 25
#define TXT_ID_3_Y_LOCATION BTN_ID_2_Y_LOCATION+BTN_ID_2_HEIGHT+INTERWIDGET_SPACE - 5
#define TXT_ID_3_WIDTH 50
#define TXT_ID_3_HEIGHT 30 

#define TXT_ID_4_X_LOCATION TXT_ID_3_X_LOCATION
#define TXT_ID_4_Y_LOCATION TXT_ID_3_Y_LOCATION+TXT_ID_3_HEIGHT+2
#define TXT_ID_4_WIDTH TXT_ID_3_WIDTH
#define TXT_ID_4_HEIGHT TXT_ID_3_HEIGHT

#define TXT_ID_5_X_LOCATION TXT_ID_3_X_LOCATION + TXT_ID_3_WIDTH + 2
#define TXT_ID_5_Y_LOCATION TXT_ID_3_Y_LOCATION  
#define TXT_ID_5_WIDTH 100
#define TXT_ID_5_HEIGHT TXT_ID_3_HEIGHT

#define TXT_ID_6_X_LOCATION TXT_ID_4_X_LOCATION + TXT_ID_4_WIDTH + 2
#define TXT_ID_6_Y_LOCATION TXT_ID_4_Y_LOCATION  
#define TXT_ID_6_WIDTH TXT_ID_5_WIDTH
#define TXT_ID_6_HEIGHT TXT_ID_4_HEIGHT

    /* Create "Toggle PHY" textbox (TXB_ID_0) */
    UG_TextboxCreate(&window_1, &textbox_toggle_phy, TXB_ID_0, TXT_ID_0_X_LOCATION, TXT_ID_0_Y_LOCATION, TXT_ID_0_X_LOCATION+TXT_ID_0_WIDTH, TXT_ID_0_Y_LOCATION+TXT_ID_0_HEIGHT);  
    UG_TextboxSetFont(&window_1, TXB_ID_0, &FONT_8X12);
    UG_TextboxSetText(&window_1 , TXB_ID_0 , "Button 1: PHY") ;
    UG_TextboxSetForeColor (&window_1 , TXB_ID_0 , C_MAROON ) ;
    UG_TextboxSetBackColor (&window_1 , TXB_ID_0 , C_DODGER_BLUE ); 
    UG_TextboxSetAlignment (&window_1 , TXB_ID_0 , ALIGN_CENTER );

    /* Create "PHY" selection button (BTN_ID_0) */
    UG_ButtonCreate(&window_1, &phy_button, BTN_ID_0, BTN_ID_0_X_LOCATION, BTN_ID_0_Y_LOCATION, BTN_ID_0_X_LOCATION+BTN_ID_0_WIDTH, BTN_ID_0_Y_LOCATION+BTN_ID_0_HEIGHT);
    UG_ButtonSetStyle(&window_1, BTN_ID_0, BTN_STYLE_3D|BTN_STYLE_USE_ALTERNATE_COLORS);
    UG_ButtonSetForeColor(&window_1, BTN_ID_0, C_YELLOW);
    UG_ButtonSetBackColor(&window_1, BTN_ID_0, C_MEDIUM_BLUE);  
    UG_ButtonSetFont(&window_1, BTN_ID_0, &FONT_10X16);
    UG_ButtonSetText(&window_1, BTN_ID_0, "1 Mbps");    

    /* Create "Toggle output power" textbox (TXB_ID_1) */
    UG_TextboxCreate(&window_1, &textbox_toggle_power, TXB_ID_1, TXT_ID_1_X_LOCATION, TXT_ID_1_Y_LOCATION, TXT_ID_1_X_LOCATION+TXT_ID_1_WIDTH, TXT_ID_1_Y_LOCATION+TXT_ID_1_HEIGHT);  
    UG_TextboxSetFont(&window_1, TXB_ID_1, &FONT_8X12);
    UG_TextboxSetText(&window_1 , TXB_ID_1 , "Button 2: Power") ;
    UG_TextboxSetForeColor (&window_1 , TXB_ID_1, C_MAROON ) ;
    UG_TextboxSetBackColor (&window_1 , TXB_ID_1, C_DODGER_BLUE ); 
    UG_TextboxSetAlignment (&window_1 , TXB_ID_1, ALIGN_CENTER );  

    /* Create "Power" selection button (BTN_ID_1) */
    UG_ButtonCreate(&window_1, &power_button, BTN_ID_1, BTN_ID_1_X_LOCATION, BTN_ID_1_Y_LOCATION, BTN_ID_1_X_LOCATION+BTN_ID_1_WIDTH, BTN_ID_1_Y_LOCATION+BTN_ID_1_HEIGHT);
    UG_ButtonSetStyle(&window_1, BTN_ID_1, BTN_STYLE_3D|BTN_STYLE_USE_ALTERNATE_COLORS);
    UG_ButtonSetForeColor(&window_1, BTN_ID_1, C_YELLOW);
    UG_ButtonSetBackColor(&window_1, BTN_ID_1, C_MEDIUM_BLUE);  
    UG_ButtonSetFont(&window_1, BTN_ID_1, &FONT_10X16);
    UG_ButtonSetText(&window_1, BTN_ID_1, "0 dBm"); 

    /* Create "Toggle output power" textbox (TXB_ID_2) */
    UG_TextboxCreate(&window_1, &textbox_toggle_adv_type, TXB_ID_2, TXT_ID_2_X_LOCATION, TXT_ID_2_Y_LOCATION, TXT_ID_2_X_LOCATION+TXT_ID_2_WIDTH, TXT_ID_2_Y_LOCATION+TXT_ID_2_HEIGHT);  
    UG_TextboxSetFont(&window_1, TXB_ID_2, &FONT_8X12);
    UG_TextboxSetText(&window_1 , TXB_ID_2 , "Button 3: Adv. type") ;
    UG_TextboxSetForeColor (&window_1 , TXB_ID_2, C_MAROON ) ;
    UG_TextboxSetBackColor (&window_1 , TXB_ID_2, C_DODGER_BLUE ); 
    UG_TextboxSetAlignment (&window_1 , TXB_ID_2, ALIGN_CENTER );  

    /* Create "Advertising type" selection button (BTN_ID_2) */
    UG_ButtonCreate(&window_1, &adv_button, BTN_ID_2, BTN_ID_2_X_LOCATION, BTN_ID_2_Y_LOCATION, BTN_ID_2_X_LOCATION+BTN_ID_2_WIDTH, BTN_ID_2_Y_LOCATION+BTN_ID_2_HEIGHT);
    UG_ButtonSetStyle(&window_1, BTN_ID_2, BTN_STYLE_3D|BTN_STYLE_USE_ALTERNATE_COLORS);
    UG_ButtonSetForeColor(&window_1, BTN_ID_2, C_YELLOW);
    UG_ButtonSetBackColor(&window_1, BTN_ID_2, C_MEDIUM_BLUE);  
    UG_ButtonSetFont(&window_1, BTN_ID_2, &FONT_10X16);
    UG_ButtonSetText(&window_1, BTN_ID_2, "Connectable"); 

    /* Create "RSSI" textbox (TXB_ID_3) */
    UG_TextboxCreate(&window_1, &textbox_rssi_label, TXB_ID_3, TXT_ID_3_X_LOCATION, TXT_ID_3_Y_LOCATION, TXT_ID_3_X_LOCATION+TXT_ID_3_WIDTH, TXT_ID_3_Y_LOCATION+TXT_ID_3_HEIGHT);  
    UG_TextboxSetFont(&window_1, TXB_ID_3, &FONT_8X12);
    UG_TextboxSetText(&window_1 , TXB_ID_3 , "RSSI: ") ;
    UG_TextboxSetForeColor (&window_1 , TXB_ID_3 , C_MAROON ) ;
    UG_TextboxSetBackColor (&window_1 , TXB_ID_3 , C_DODGER_BLUE ); 
    UG_TextboxSetAlignment (&window_1 , TXB_ID_3 , ALIGN_CENTER );

    /* Create "PER" textbox (TXB_ID_4) */
    UG_TextboxCreate(&window_1, &textbox_per_label, TXB_ID_4, TXT_ID_4_X_LOCATION, TXT_ID_4_Y_LOCATION, TXT_ID_4_X_LOCATION+TXT_ID_4_WIDTH, TXT_ID_4_Y_LOCATION+TXT_ID_4_HEIGHT);  
    UG_TextboxSetFont(&window_1, TXB_ID_4, &FONT_8X12);
    UG_TextboxSetText(&window_1 , TXB_ID_4 , "PER: ") ;
    UG_TextboxSetForeColor (&window_1 , TXB_ID_4 , C_MAROON ) ;
    UG_TextboxSetBackColor (&window_1 , TXB_ID_4 , C_DODGER_BLUE ); 
    UG_TextboxSetAlignment (&window_1 , TXB_ID_4 , ALIGN_CENTER );

    /* Create "RSSI" textbox for the numbers (TXB_ID_5) */
    UG_TextboxCreate(&window_1, &textbox_rssi_number, TXB_ID_5, TXT_ID_5_X_LOCATION, TXT_ID_5_Y_LOCATION, TXT_ID_5_X_LOCATION+TXT_ID_5_WIDTH, TXT_ID_5_Y_LOCATION+TXT_ID_5_HEIGHT);  
    UG_TextboxSetFont(&window_1, TXB_ID_5, &FONT_8X12);
    UG_TextboxSetText(&window_1 , TXB_ID_5 , "###") ;
    UG_TextboxSetForeColor (&window_1 , TXB_ID_5 , C_MAROON ) ;
    UG_TextboxSetBackColor (&window_1 , TXB_ID_5 , C_DODGER_BLUE ); 
    UG_TextboxSetAlignment (&window_1 , TXB_ID_5 , ALIGN_CENTER );

    /* Create "PER" textbox for the numbers (TXB_ID_6) */
    UG_TextboxCreate(&window_1, &textbox_per_number, TXB_ID_6, TXT_ID_6_X_LOCATION, TXT_ID_6_Y_LOCATION, TXT_ID_6_X_LOCATION+TXT_ID_6_WIDTH, TXT_ID_6_Y_LOCATION+TXT_ID_6_HEIGHT);  
    UG_TextboxSetFont(&window_1, TXB_ID_6, &FONT_8X12);
    UG_TextboxSetText(&window_1 , TXB_ID_6 , "###") ;
    UG_TextboxSetForeColor (&window_1 , TXB_ID_6 , C_MAROON ) ;
    UG_TextboxSetBackColor (&window_1 , TXB_ID_6 , C_DODGER_BLUE ); 
    UG_TextboxSetAlignment (&window_1 , TXB_ID_6 , ALIGN_CENTER );

    // Start execution.  
    NRF_LOG_INFO("Long range demo  --peripheral--");
    instructions_print();

    set_current_adv_params_and_start_advertising();

    /* Finally , show the window */
    UG_WindowShow( &window_1 ) ;

    // Enter main loop.
    for (;;)
    {
        UG_Update();
        idle_state_handle();
    }
}


/**
 * @}
 */
